Curtain grid based elements cannot be grouped.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotGroupCurtainGridHost { get; }
  Visual Basic
Public Shared ReadOnly Property CannotGroupCurtainGridHost As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotGroupCurtainGridHost {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CurtainWallFailures Class
  Autodesk.Revit.DB Namespace